<?php

return [
    'name' => 'الفرص الوظيفية',
    'create' => 'إنشاء فرصة وظيفية جديدة',
    'edit' => 'تحرير الفرصة الوظيفية',
    'form' => [
        'name' => 'الاسم',
        'name_placeholder' => 'اسم الفرصة الوظيفية (الحد الأقصى 255 حرف)',
        'permalink' => 'الرابط الثابت',
        'permalink_placeholder' => 'الرابط الثابت (سيتم إنتاجه تلقائياً من الاسم إذا ترك فارغاً)',
        'description' => 'الوصف',
        'description_placeholder' => 'وصف مختصر (الحد الأقصى 400 حرف)',
        'content' => 'المحتوى',
        'image' => 'الصورة المميزة',
        'note' => 'محتوى الملاحظة',
        'format_type' => 'نوع التنسيق',
    ],
    'statuses' => [
        'draft' => 'مسودة',
        'pending' => 'في الانتظار',
        'published' => 'منشور',
    ],
    'notices' => [
        'no_select' => 'يرجى اختيار فرصة وظيفية واحدة على الأقل لتنفيذ هذا الإجراء!',
        'update_success_message' => 'تم التحديث بنجاح',
    ],
    'cannot_delete' => 'لا يمكن حذف الفرصة الوظيفية',
    'deleted' => 'تم حذف الفرصة الوظيفية',
    'menu' => 'الفرص الوظيفية',
];
